<html><head>
<link rel="stylesheet" href="../../default_style.css">
<title>Eclipse Foundation</title>
</head>
<body text="#000000" bgcolor="#ffffff" link="#0000ee" vlink="#551a8b" alink="#ff0000">
<table border=0 cellspacing=5 cellpadding=2 width="100%" >
  <tr> 
    <td align=left width="72%"> <font class=indextop>&nbsp; Eclipse Toolplattform 
      </font><br>
    <font class=indexsub>&nbsp; </font></td>
    <td width="28%"><img src="../../images/Idea.jpg" height=86 width=120></td>
  </tr>
</table>
<table border=0 cellspacing=5 cellpadding=2 width="100%" >
  <tr> 
    <td align="left" valign="top" bgcolor="#0080C0"><b><font color="#FFFFFF" face="Arial,Helvetica">Presseinformation</font></b></td>
  </tr>
  <tr> 
    <td><br>
      <h1 ALIGN="CENTER"><b><span style='font-size:16.0pt;font-family:Arial;"Times New Roman"'><b> 
        Eclipse liefert Toolplattform f&uuml;r den gesamten Lebenszyklus der Softwareentwicklung</b></span></b></h1>
      <div align="center"><i>Neue und verbesserte Open-Source-Werkzeuge und -Frameworks 
        von Eclipse angek&uuml;ndigt</i><br>
      </div>
      
        <br>
      <P><b>SAN FRANCISCO, Kalifornien, 27. Juni 2005</b>. Die Eclipse Foundation 
        hat heute die Ver&ouml;ffentlichung neuer Versionen zahlreicher Eclipse-Open-Source-Projekte 
        angek&uuml;ndigt. Dazu geh&ouml;ren prominente Projekte, wie die erfolgreiche 
        und weit verbreitete Eclipse-Plattform und Eclipse-Java-IDE. Mit der Vision 
        einer integrierten Plattform f&uuml;r den gesamten Lebenszyklus der Softwareentwicklung 
        liefert die Eclipse-Community Werkzeuge f&uuml;r Tests und Performance, 
        Business Intelligence und Reporting, Java, C/C++, Web-Anwendungsentwicklung 
        und aspektorientierte Programmierung. </p>
	  
      <p>&quot;Eclipse verwirklicht seine Vision einer universellen Entwicklungs-Plattform 
        mit Werkzeugen und Frameworks, die den gesamten Lebenszyklus der Softwareentwicklung 
        abdecken&quot;, sagt Mike Milinkovich, Gesch&auml;ftsf&uuml;hrer der Eclipse 
        Foundation. &quot;Viele Leute kennen und sch&auml;tzen Eclipse als gro&szlig;artige 
        Java IDE. Eclipse hat aber dar&uuml;ber hinaus eine weit reichende Bedeutung 
        f&uuml;r unabh&auml;ngige Software-Hersteller, die Eclipse als Plattform 
        zur Entwicklung und Integration ihrer Produkte nutzen k&ouml;nnen. Software-Entwickler, 
        Architekten und Tester profitieren von einem &Ouml;kosystem mit &uuml;ber 
        100 Software-Herstellern und hunderten von Produkten, die es Entwicklerteams 
        erlauben, die f&uuml;r ihre Anforderungen am besten geeigneten Werkzeuge 
        einfach zu kombinieren.&quot; </p>
      <p>Eine neue Version des Eclipse Software Development Kits, Eclipse SDK 
        3.1 mit der Eclipse Plattform, den Java Development Tools und dem Plugin 
        Development Environment, wird in der Woche vom 27. Juni auf der offiziellen 
        Eclipse-Website zum Download zur Verf&uuml;gung stehen. Innerhalb der 
        n&auml;chsten 30 Tage werden weitere Eclipse 3.1 kompatible Eclipse-Projekte 
        verf&uuml;gbar sein. </p>
      <p>Als leistungsf&auml;hige einheitliche Plattform erm&ouml;glichen diese 
        neuen Werkzeuge Programmierern folgende Aufgaben effizient zu bew&auml;ltigen:</p>
	  
      <ul>
        <li><b>Entwickeln und Deployen von J2EE 1.4-Anwendungen</b>: Neue Assistenten 
          und Werkzeuge f&uuml;r J2EE-Anwendungen. Die f&uuml;hrenden J2EE Anbieter 
          - BEA, Borland, IBM, JBoss und ObjectWeb - werden diese Tools als Plattform 
          f&uuml;r ihre J2EE-Entwicklungswerkzeuge einsetzen. </li>
        <li><b>Volle Einbindung von J2SE 5.0</b>: Alles, was Entwickler an Eclipse 
          sch&auml;tzen, z. B. Quick Fix, Suchfunktion, Code Formatierung, arbeitet 
          nahtlos mit J2SE 5.0-Features, wie z. B. Annotationen und generischen 
          Typen.</li>
        <li><b>Rich Client-Applikationen</b>: Neue und verbesserte Werkzeuge k&ouml;nnen 
          zur Erstellung von leistungsf&auml;higen Applikationen auf Basis der 
          Eclipse Rich Client Plattform (RCP) genutzt werden. </li>
        <li><b>Skalierbarkeit</b>: Signifikante Performance-Verbesserungen der 
          Basis- und Test-Plattform unterst&uuml;tzen gro&szlig;e Entwicklungsteams 
          mit k&uuml;rzeren Startup-Zeiten, schneller reagierender Benutzeroberfl&auml;che 
          und geringerem Speicherbedarf. </li>
        <li><b>Einfache Entwicklung und Erweiterung</b>: Die Benutzerfreundlichkeit 
          und die Erweiterbarkeit der Werkzeuge wird mit Hilfe dieses Releases 
          noch einmal deutlich verbessert.</li>
        <li><b>Web-Services erstellen und validieren</b>: Die Eclipse-Web-Service-Validierungswerkzeuge 
          testen die Konformit&auml;t von Web-Services mit den WS-I-Profilen und 
          bilden die Basis f&uuml;r die Java-Referenzimplementierung der WS-I-Test-Werkzeuge.</li>
        <li><b>Einfaches Erstellen von Web-Applikationen</b>: Neue Editoren erlauben 
          die effiziente Bearbeitung von JSP-, HTML-, XML-, CSS-, DTD- und JavaScript-Dateien. 
        </li>
        <li><b>Effektives Test- und Performance-Tuning</b>: Die enge Integration 
          der Eclipse-Test- und Performance-Werkzeuge mit JUnit und neue GUI-F&auml;higkeiten 
          der Werkzeuge erm&ouml;glichen einen effizienten Ansatz zur Eingrenzung 
          von Performance-Problemen mit Unit Tests. </li>
        <li><b>Visuelle Erstellung von Benutzerschnittstellen f&uuml;r Eclipse 
          RCP</b>: Der Eclipse-Visual-Editor unterst&uuml;tzt jetzt die M&ouml;glichkeit, 
          Eclipse-RCP-Anwendungen visuell zu entwickeln. </li>
        <li><b>Verbesserte Ant-Unterst&uuml;tzung</b>: Neue Debug- und Refactoring-Unterst&uuml;tzung 
          f&uuml;r Ant Skripte. Einfache Erstellung von Eclipse-Projekten aus 
          Ant Scripten und Export von Ant Skripten aus Eclipse. </li>
        <li><b>Aspektorientierte Programmierung</b>: Das neue AspectJ5-Release 
          bietet Unterst&uuml;tzung f&uuml;r J2SE 5.0 einschlie&szlig;lich Annotationen 
          und generischen Typen sowie M&ouml;glichkeiten f&uuml;r einen neuen 
          annotationsbasierten Entwicklungsstil. </li>
      </ul>      
	  <p>Folgende Projekte haben Releases angek&uuml;ndigt: Eclipse-Plattform, 
        Test- und Perfomance-Tools-Plattform, Web-Tools-Plattform, Business Intelligence- 
        und Reporting-Tools-Plattform, Eclipse-Modeling-Framework, Graphical-Editing-Framework, 
        UML2, Visual Editor und AspectJ. F&uuml;r eine komplette Liste der Funktionalit&auml;ten 
        und Downloads besuchen Sie bitte: <a href="http://www.eclipse.org/org/june05release/projects.html">http://www.eclipse.org/org/june05release/projects.html</a>. 
      </p>
      
	  <p>Don Campbell, Vizepr&auml;sident f&uuml;r Produktentwicklung und Technologie 
        bei Cognos kommentierte: &quot;Eclipse setzt mit diesem sehnlich erwarteten 
        Release erneut einen Standard f&uuml;r die Softwareentwicklung. Unsere 
        Entwickler werden ihre positiven Eclipse-Erfahrungen ausbauen und mit 
        den neuen Werkzeugen die Entwicklung der gesamten Cognos Software weiter 
        vereinfachen und rationalisieren.&quot;</p>
      <p><b>Breite Unterst&uuml;tzung von J2EE-Anbietern</b></p>
      <p>&quot;Mit der Co-Projektleitung des Eclipse-Web-Tools-Projekts hat auch 
        BEA einen signifikanten technischen sowie personellen Beitrag zum Erfolg 
        des Projektes beigetragen, der durch dieses neue Release best&auml;tigt 
        wird.&quot; sagt Tim Wager, Entwicklungsleiter, BEA Systems. &quot;BEA 
        ist ein starker Bef&uuml;rworter und Unterst&uuml;tzer von Eclipse und 
        wir sind davon &uuml;berzeugt, dass Eclipse wichtige Innovationen zur 
        Beschleunigung der Softwareentwicklung ma&szlig;geblich vorantreibt.&quot;</p>
      <p>&quot;Borlands n&auml;chste Generation des JBuilder wird Eclipse inkl. 
        Web Tools als Basis-Plattform zur Integration nutzen,&quot; sagt Rob Cheng, 
        Direktor f&uuml;r Entwickler L&ouml;sungen bei Borland. &quot;Eclipse 
        bietet eine bew&auml;hrte und zuverl&auml;ssige Plattform f&uuml;r die 
        Erstellung kommerzieller J2EE Werkzeuge. Insbesondere Borlands &#130;Peloton' 
        Release, unser erstes Eclipse-basiertes JBuilder Produkt, wird unser Markenzeichen 
        - ausgezeichnete Bedienfreundlichkeit - mit fortgeschrittenen Kollaborationsm&ouml;glichkeiten, 
        ALM Integration und Firmenkunden gerechtem Support f&uuml;r Eclipse kombinieren. 
        Dabei bleiben den Entwicklern die volle Flexibilit&auml;t der Eclipse 
        Plattform und alle M&ouml;glichkeiten des &Ouml;ko-Systems von Eclipse 
        Plugins erhalten.&quot; <br>
        <br>
        Lee Nackman, Vize Pr&auml;sident f&uuml;r Produktentwicklung, IBM Rational, 
        sagt: &quot;Eclipse 3.1 reflektiert die gestiegene Bedeutung und den Einfluss 
        von Eclipse auf die Software-Industrie. Eclipse 3.1 bringt nicht nur erweiterte 
        Unterst&uuml;tzung f&uuml;r Java und Web Entwicklung, sondern ist ein 
        gro&szlig;er Schritt in Richtung Integration des gesamten Lebenszyklus 
        der Softwareentwicklung. IBM setzt sein umfangreiches Engagement f&uuml;r 
        Eclipse fort - sowohl in unserem f&uuml;hrenden Beitrag zur Eclipse Entwicklung 
        als auch bei der Integration der IBM Software Entwicklungsprodukte auf 
        Basis der Eclipse Plattform.&quot;<br>
        <br>
        &quot;Mit unseren gemeinsamen Open-Source-Wurzeln und der Vision, Open 
        Source f&uuml;r die Unternehmens-IT nutzbar zu machen, passen Eclipse 
        und JBoss gut zueinander.&quot; sagt Shaun Connolly, Vize Pr&auml;sident 
        f&uuml;r Produktmanagement, JBoss, Inc. &quot;JBoss hat bereits die Eclipse-IDE- 
        und -J2EE- Werkzeuge als zentrale Bestandteile des JBoss Enterprise Middleware 
        Systems etabliert und wird auch weiterhin Eclipse als unabh&auml;ngige 
        Entwicklungsplattform unterst&uuml;tzen.&quot; </p>
      <p>&quot;Als der Initiator des Projektvorschlags und Co-Projektleiter des 
        Web-Tools-Projekts ist ObjectWeb begeistert &uuml;ber den gro&szlig;en 
        Zuspruch f&uuml;r die Eclipse-Web-Tools-Plattform, der durch die Beteiligung 
        von Anbietern wie BEA und JBoss deutlich wird. Wir sehen diesen Erfolg 
        als wichtigen Schritt zur Etablierung eines nachhaltigen &Ouml;kosystems 
        rund um Open-Source-J2EE-Plattformen, wie z. B. JOnAS&quot;, sagt Chrishiphe 
        Ney, Executive Direktor von ObjectWeb und Co-Projektleiter des Eclipse-Web-Tools-Projekts. 
        &quot;Bereits zum Start des Projekts vor einem Jahr, der eine Code-Kontribution 
        des Lomboz-Projekts beinhaltete, haben wir an eine langfristige Zusammenarbeit 
        mit der Eclipse-Community geglaubt. Wir freuen uns auf die weitere und 
        erweiterte Zusammenarbeit, z. B. mit Werkzeugen f&uuml;r unsere Enterprise 
        Service Bus (ESB)-Technologien.&quot;</p>
      </td>
  </tr>
</table>
 




 


<table width="100%" cellspacing=0 cellpadding=3 align=center>
		<tr bgcolor="#999999">
		
    <td align="left" valign="top" bgcolor="#0080C0"><b><font color="#FFFFFF" face="Arial,Helvetica">Über Eclipse</font></b></td>
		</TR>
		<TR>
		<td align=left>
		<TABLE  width="100%" CELLSPACING=0 CELLPADDING=3>
		<tr>
		  <td> 
            <P> Eclipse ist eine Open Source Community mit Fokus auf erweiterbare 
              Software-Entwicklungswerkzeuge und Anwendungsplattformen. Eclipse 
              stellt eine erweiterbare Werkzeugplattform f&uuml;r den gesamten 
              Lebenszyklus der Softwareentwicklung bereit und bietet Werkzeuge 
              f&uuml;r Modellierung, Test und Performance, Business Intelligence, 
              Embedded Entwicklung, IDEs f&uuml;r Java, C++ und weitere Sprachen, 
              sowie Werkzeuge und eine Plattform f&uuml;r Rich Client Applikationen. 
              Eine gro&szlig;es und lebendiges &Ouml;kosystem aus bedeutenden 
              Technologie-Unternehmen, innovativen Startups, Universit&auml;ten, 
              Forschungseinrichtungen und Individuen erweitert, erg&auml;nzt und 
              unterst&uuml;tzt die Eclipse Plattform.<br>
              <br>
              Die Eclipse Foundation ist eine von Mitgliedern getragene gemeinn&uuml;tzige 
              Organisation nach US-Recht und stellt die Infrastruktur und Dienstleistungen 
              f&uuml;r Eclipse Open Source Projekte bereit. Ausf&uuml;hrliche 
              Informationen zu Eclipse und der Eclipse Foundation sind unter <a href="http://www.eclipse.org/" target="_top">http://www.eclipse.org</a> 
              erh&auml;ltlich.</p>
          </td>
		</tr>
        </table></table> 
	<table width="100%" cellspacing=0 cellpadding=3 align=center>
		<tr bgcolor="#999999">
    <td align="left" valign="top" bgcolor="#0080C0"><b><font color="#FFFFFF" face="Arial,Helvetica">Weitere Informationen:</font></b></td>
		</TR>
</table>
		
<table width="100%" border="0" cellspacing="5">
  <tr>
    <td > 
      <div align="center"> 
        <p>INNOOPRACT Informationssysteme GmbH<br>
          Jochen Krause<br>
          Gesch&auml;ftsf&uuml;hrer<br>
          Tel.: +49 7 21/ 966 2360<br>
          eMail: <a href="mailto:jkrause@innoopract.de">jkrause@innoopract.de</a><br>
        </p>
      </div>
    </td>
  </tr>
</table>
	<table width="100%" cellspacing=0 cellpadding=3 align=center>
		<tr bgcolor="#999999">
    <td align="left" valign="top" bgcolor="#0080C0"><b><font color="#FFFFFF" face="Arial,Helvetica">Pressekontakt:</font></b></td>
		</TR>
</table>
		
<table width="100%" border="0" cellspacing="5">
  <tr>
    <td > 
      <div align="center"> 
        <p>saalto Agentur und Redaktion GmbH<br>
          Alin Fr&auml;drich<br>
          Stephanienstra&szlig;e 20<br>
          76133 Karlsruhe<br>
          Tel.: +49 7 21/1 60 88-78<br>
          Fax: +49 7 21/1 61 09-88<br>
          eMail: <a href="mailto:alin@saalto.de">alin@saalto.de</a><br>
        </p>
      </div>
    </td>
  </tr>
</table>
		<TABLE  width="100%" CELLSPACING=0 CELLPADDING=3>
		<tr>
		  <td> 
            <hr width="85%">
      <P>Marken oder Produktnamen sind registrierte Warenzeichen oder Warenzeichen 
        ihrer entsprechenden Eigent&uuml;mer. Java und alle auf Java basierten 
        Warenzeichen sind Warenzeichen von Sun Microsystems in den USA oder anderen 
        L&auml;ndern. <br>
      </P>
<hr width="85%">
    </td>
		</tr>
        </table>         
 
</body></html>
