<html><head>
<link rel="stylesheet" href="../../default_style.css">
<title>Eclipse Foundation</title>
</head>
<body text="#000000" bgcolor="#ffffff" link="#0000ee" vlink="#551a8b" alink="#ff0000">
<table border=0 cellspacing=5 cellpadding=2 width="100%" >
  <tr> 
    <td align=left width="72%"> <font class=indextop>&nbsp;Eclipse RCP </font><br>
    <font class=indexsub>&nbsp; </font></td>
    <td width="28%"><img src="../../images/Idea.jpg" height=86 width=120></td>
  </tr>
</table>
<table border=0 cellspacing=5 cellpadding=2 width="100%" >
  <tr> 
    <td align="left" valign="top" bgcolor="#0080C0"><b><font color="#FFFFFF" face="Arial,Helvetica">Presseinformation</font></b></td>
  </tr>
  <tr> 
    <td> 
      <h1 ALIGN="CENTER"><b><span style='font-size:16.0pt;font-family:Arial;"Times New Roman"'>Eclipse 
        erweitert Rich-Client-Plattform</span></b></h1>
      <div align="center"><i>Organisationen entwickeln eine neue Generation von 
        Rich-Client-Applikationen auf Basis der Eclipse-Plattform</i><br>
        <br>
      </div>
      <P><b>SAN FRANCISCO, Kalifornien, 27. Juni 2005</b>. Die Eclipse Foundation 
        ver&ouml;ffentlicht heute die Eclipse-Rich-Client-Plattform (RCP) 3.1. 
        Das Release liefert verbesserte Tools, vereinfachte Installationsm&ouml;glichkeiten 
        und Cross-Platform-Builds - und erm&ouml;glicht Programmierern damit das 
        Entwickeln einfach installierbarer Rich-Client-Applikationen in kurzer 
        Zeit. Open Source Organisationen und kommerzielle Anbieter haben sich 
        f&uuml;r die Eclipse-RCP entschieden, um eine neue Generation von Rich-Client-Applikationen 
        zu schaffen. </p>
      <p>&quot;Die Eclipse-Rich-Client-Plattform (RCP) ist real - hier und heute 
        - und wir verbessern sie st&auml;ndig mit immer leistungsf&auml;higeren 
        Werkzeugen&quot;, sagt Mike Milinkovich, Gesch&auml;ftsf&uuml;hrer der 
        Eclipse Foundation. &quot;Organisationen, die Rich-Client-Applikationen 
        erstellen, profitieren von der Eclipse Plattform mit ihrer dynamischen 
        Plug-in-Architektur und dem Update-Manager. Die noch einfacheren Entwicklungsm&ouml;glichkeiten 
        und Benutzerfreundlichkeit dieses aktuellen Release werden die breite 
        Akzeptanz von Eclipse-RCP weiter vergr&ouml;&szlig;ern.&quot; </p>
      <p><b>Eclipse RCP 3.1: Features und Funktionalit&auml;ten:</b></p>
      <ul>
        <li><b>Verbesserte Performance</b>: K&uuml;rzere Startzeiten und geringere 
          Speicheranforderungen verbessern den Nutzen Eclipse-RCP-basierter Applikationen 
          f&uuml;r den Endanwender. </li>
        <li><b>Erweiterte Tool-Unterst&uuml;tzung</b>: Der Eclipse-Visual-Editor 
          unterst&uuml;tzt jetzt die Entwicklung von SWT und vereinfacht damit 
          Entwicklung der Benutzerschnittstelle f&uuml;r RCP Applikationen. Die 
          Eclipse-Plugin-Entwicklungsumgebung (PDE) enth&auml;lt zus&auml;tzliche 
          Tools f&uuml;r das Entwickeln und Vermarkten von RCP Anwendungen. </li>
        <li><b>Einfachere Auslieferung</b>: Unterst&uuml;tzung f&uuml;r Java-Web-Start 
          (JNLP) und verbesserte Unterst&uuml;tzung f&uuml;r dynamisches Plug-in 
          Nachladen erleichtern die Auslieferung von RCP-Applikationen. </li>
        <li><b>Visual Editor-Unterst&uuml;tzung</b>: Der Eclipse-Visual-Editor 
          unterst&uuml;tzt jetzt M&ouml;glichkeit Eclipse-RCP-Anwendungen visuell 
          zu entwickeln. </li>
      </ul>
      <p>Eine komplette Liste der Features und Funktionalit&auml;ten von Eclipse 
        RCP 3.1 finden Sie online unter: <a href="http://www.eclipse.org/rcp" target="_top">www.eclipse.org/rcp</a> 
        . </p>
      <p>Open-Source-Anwendungen aus unterschiedlichsten Anwendungsbereichen nutzen 
        bereits Eclipse RCP, z.B. RSS-Newsreader, Desktop-Content-Management und 
        Aktienhandel. Im kommerziellen Bereich dominieren Unternehmensanwendungen 
        wie beispielsweise Customer Relationship Management (CRM) oder Enterprise 
        Resource Planning (ERP).</p>
      <p>Eclipse-RCP bietet eine leistungsf&auml;hige und umfassende Plattform zur 
        Entwicklung und Auslieferung von Client-Applikationen auf Linux, Windows, 
        OS/X und anderen Desktop-Plattformen. Eclipse-RCP beinhaltet:</p>
      <ul>
        <li>Ein einfaches, dynamisches Komponentenmodell zur Entwicklung von Plug-ins 
          auf Basis des OSGi Industriestandards.</li>
        <li>Die M&ouml;glichkeit, Desktop-Anwendungen zu entwickeln, die das native 
          Look &amp; Feel der Windows-, Linux- und OS/X-Plattformen &uuml;bernehmen. 
        </li>
        <li>Einen Update-Manager, der es erlaubt, Applikationen von einem zentralen 
          Server zu verwalten und automatisch mit Patches und neuen Features zu 
          aktualisieren. </li>
        <li>Mehrere Frameworks, die die Entwicklung von RCP Applikationen beschleunigen: 
          Generische Benutzeroberfl&auml;che mit Navigation, Fensterhandling und 
          Toolbar sowie Men&uuml; Management und Management von Benutzereinstellungen.</li>
      </ul>
      <p>&quot;Die Tatsache, dass Eclipse-RCP natives Look &amp; Feel mit einem 
        automatisierten Updatemechanismus kombiniert, hat uns die Entscheidung 
        f&uuml;r RCP als Grundlage unserer Applikationen sehr einfach gemacht&quot;, 
        erkl&auml;rte Jon Smith, Pr&auml;sident von RPC Software. &quot;Das Release 
        Management unser ERP-Applikation hat sich damit enorm vereinfacht - die 
        Eclipse-Plug-in-Architektur erlaubt es uns kundenspezifische Erweiterungen 
        einzuspielen, ohne das Basis System ver&auml;ndern zu m&uuml;ssen. RCP 
        bietet konkrete Vorteile f&uuml;r die Java-Anwendungsentwicklung und ist 
        die perfekte Alternative zu anderen propriet&auml;ren und teuren Anwendungsplattformen.&quot;</p>
      <p>&quot;Die Entscheidung f&uuml;r Eclipse SWT war sicher ein Schl&uuml;sselfaktor 
        zum Erfolg des Azureus BitTorrent Client. Leicht zu erlernen und einfach 
        anzuwenden - auch f&uuml;r die komplexe Benutzerschnittstelle der Azureus 
        Anwendung&quot;, erkl&auml;rt Oliver Chalouhi, Gesch&auml;ftsf&uuml;hrer 
        von Aelitis und Administrator des Azureus Open-Source-Projekts - dem SourceForge 
        Projekt mit der h&ouml;chsten Wertung. &quot;Aber den gr&ouml;&szlig;ten 
        Nutzen haben unsere Anwender, die von einer schnellen und effektiven Benutzerschnittstelle 
        profitieren und nicht merken, dass unsere Applikation in Java geschrieben 
        wurde. SWT ist eindeutig die beste Technologie f&uuml;r hochwertige Benutzerschnittstellen 
        f&uuml;r Endanwender.&quot;</p>
      <p>&quot;Siebels neue Produktangebote erm&ouml;glichen das einfache Erstellen 
        von SOA-Applikationen nach dem Baukasten-Prinzip - mit nativen Benutzerschnittstellen 
        auf Basis von Eclipse-RCP.&quot; sagt David Bernstein, Vize Pr&auml;sident 
        f&uuml;r neue Technologien bei Siebel Systems. &quot; Eclipse bietet genau 
        die Funktionalit&auml;t, die unsere Kunden ben&ouml;tigen, um schnell 
        und einfach native Applikationen auf Basis von J2EE zu entwickeln und 
        auszuliefern. Und weil Eclipse Open Source ist, k&ouml;nnen wir dar&uuml;ber 
        hinaus von der gro&szlig;en Community aus Entwicklern und Software-Herstellern 
        profitieren.&quot;<br>
      </p>
      </td>
  </tr>
</table>
 




 


<table width="100%" cellspacing=0 cellpadding=3 align=center>
		<tr bgcolor="#999999">
		
    <td align="left" valign="top" bgcolor="#0080C0"><b><font color="#FFFFFF" face="Arial,Helvetica">Über 
      Eclipse </font></b></td>
		</TR>
		<TR>
		<td align=left>
		<TABLE  width="100%" CELLSPACING=0 CELLPADDING=3>
		<tr>
		  <td> 
            <P> Eclipse ist eine Open Source Community mit Fokus auf erweiterbare 
              Software-Entwicklungswerkzeuge und Anwendungsplattformen. Eclipse 
              stellt eine erweiterbare Werkzeugplattform f&uuml;r den gesamten 
              Lebenszyklus der Softwareentwicklung bereit und bietet Werkzeuge 
              f&uuml;r Modellierung, Test und Performance, Business Intelligence, 
              Embedded Entwicklung, IDEs f&uuml;r Java, C++ und weitere Sprachen, 
              sowie Werkzeuge und eine Plattform f&uuml;r Rich Client Applikationen. 
              Eine gro&szlig;es und lebendiges &Ouml;kosystem aus bedeutenden 
              Technologie-Unternehmen, innovativen Startups, Universit&auml;ten, 
              Forschungseinrichtungen und Individuen erweitert, erg&auml;nzt und 
              unterst&uuml;tzt die Eclipse Plattform.<br>
              <br>
              Die Eclipse Foundation ist eine von Mitgliedern getragene gemeinn&uuml;tzige 
              Organisation nach US-Recht und stellt die Infrastruktur und Dienstleistungen 
              f&uuml;r Eclipse Open Source Projekte bereit. Ausf&uuml;hrliche 
              Informationen zu Eclipse und der Eclipse Foundation sind unter <a href="http://www.eclipse.org/" target="_top">http://www.eclipse.org</a> 
              erh&auml;ltlich.<br>
            </p>
            </td>
		</tr>
        </table></table> 
	<table width="100%" cellspacing=0 cellpadding=3 align=center>
		<tr bgcolor="#999999">
    <td align="left" valign="top" bgcolor="#0080C0"><b><font color="#FFFFFF" face="Arial,Helvetica">Weitere Informationen:</font></b></td>
		</TR>
</table>
		
<table width="100%" border="0" cellspacing="5">
  <tr>
    <td > 
      <div align="center"> 
        <p>INNOOPRACT Informationssysteme GmbH<br>
          Jochen Krause<br>
          Gesch&auml;ftsf&uuml;hrer<br>
          Tel.: +49 +49 7 21/ 966 2360<br>
          eMail: <a href="mailto:jkrause@innoopract.de">jkrause@innoopract.de</a><br>
        </p>
      </div>
    </td>
  </tr>
</table>
	<table width="100%" cellspacing=0 cellpadding=3 align=center>
		<tr bgcolor="#999999">
    <td align="left" valign="top" bgcolor="#0080C0"><b><font color="#FFFFFF" face="Arial,Helvetica">Pressekontakt:</font></b></td>
		</TR>
</table>
		
<table width="100%" border="0" cellspacing="5">
  <tr>
    <td > 
      <div align="center"> 
        <p>saalto Agentur und Redaktion GmbH<br>
          Alin Fr&auml;drich<br>
          Stephanienstra&szlig;e 20<br>
          76133 Karlsruhe<br>
          Tel.: +49 7 21/1 60 88-78<br>
          Fax: +49 7 21/1 61 09-88<br>
          eMail: <a href="mailto:alin@saalto.de">alin@saalto.de</a><br>
        </p>
      </div>
    </td>
  </tr>
</table>
		<TABLE  width="100%" CELLSPACING=0 CELLPADDING=3>
		<tr>
		  <td> 
            <hr width="85%">
      <P>Marken oder Produktnamen sind registrierte Warenzeichen oder Warenzeichen 
        ihrer entsprechenden Eigent&uuml;mer. Java und alle auf Java basierten 
        Warenzeichen sind Warenzeichen von Sun Microsystems in den USA oder anderen 
        L&auml;ndern. <br>
      </P>
<hr width="85%">
    </td>
		</tr>
        </table>         
 
</body></html>
